posts/2021-08-24-org-timer/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-Mode Timer</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Org-Mode Timer</h1>
</header><p>
Org-mode appears to be one of those friends you have known for a long time but
for some reason you just keep stumbling upon new profound things you just didn't
know about them. I had this moment when I discovered timers. There are different
ways to clock work or to start an increasing or decreasing timer which are
described in the org-mode documentation <a href="https://orgmode.org/manual/Clocking-Work-Time.html">here</a> and <a href="https://orgmode.org/manual/Timers.html#Timers">here</a>. These functions can be
used to interact with a decreasing timer:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-timer-set-timer)
(org-timer-pause-or-continue)
(org-timer-stop)
</pre>
</div>

<p>
While these timers are convenient, I was surprised that Emacs won't warn me about
a running timer when closing the application. Luckily adding a timer check only
takes a few lines of code:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'kill-emacs-query-functions
             (lambda ()
               (or (not (and (boundp 'org-timer-start-time)
                             org-timer-start-time))
                   (y-or-n-p "Quit with running org-timer?"))))
</pre>
</div>

<p>
This little piece of code is called when closing Emacs. It will check if a timer
is still running and will ask you what to do about it.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2021-08-24</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>